#include <stdio.h>

void main () {

	//int a[3][3] = { {1,2,3}, {4,5,6}, {7,8,9} }; //배열 a, 배열 a의 a[n][i] n행 i열, 0행 0열부터 2행 2열까지 총 3개의 행, 열 총 9개의 값
	//int i, j;

	//for (i = 0; i < 3; i++) { //i, 행 의미 0~2

	//	for (j = 0; j < 3; j++) { //j, 열 의미 0~2
	//		printf ("%d\t", a[i][j]);
	//	} // i = 0 -> j = 1 2 3, i = 1 -> j = 1 2 3.....

	//	printf ("\n");
	//}

	int b[4][3] = {
		{100, 200, 300},
		{10}, 
		{50, 100, 150},
		{30, 40}
	};
	int sum = 0;

	for (int i = 0; i <= 3; i++) {

		for (int j = 0; j <= 2; j++) {

			sum += b[i][j];
		}
	}
	
	printf ("%d", sum);
}